#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>

//int main()
//{
//	int a = 2;
//	int b = a << 1;//把a的二进制位向左移动一位
//	printf("b = %d\n", b);
//	return 0;
//}
//int main()
//{
//	int a = -1;
//	int b = a >> 1;//把a的二进制位向右移动一位
//	printf("b = %d\n", b);
//	//结果还是-1，说明当前的右移操作符使用的是 算术右移
//	return 0;
//}
//int main()
//{
//	int a = 3;
//	int b = 5;
//	//int c = a & b;// & - 按(2进制)位与
//	// 规则：相同不变,相异为0
//	//a 00000000000000000000000000000011  = 3
//	//b 00000000000000000000000000000101  = 5
//	//c 00000000000000000000000000000001  = 1
//	//int c = a | b;// | - 按(2进制)位或 
//	// 规则：相同不变,相异为1
//	//a 00000000000000000000000000000011  = 3
//	//b 00000000000000000000000000000101  = 5
//	//c 00000000000000000000000000000111  = 7
//	//int c = a ^ b;// ^ - 按(2进制)位异或
//	//对应的二进制位进行异或
//	//规则：相同为0，相异为1
//	//a 00000000000000000000000000000011  = 3
//	//b 00000000000000000000000000000101  = 5
//	//c 00000000000000000000000000000110  = 6
//	printf("%d\n", c);
//	return 0;
//}
//int main()
//{
//	int a = 3;
//	int b = 5;
//	//交换a,b
//	////1.使用第三变量
//	//printf("a = %d b = %d\n", a, b);
//	//int c = a;
//	//a = b;
//	//b = c;
//	//printf("a = %d b = %d\n", a, b);
//	////2.不使用第三变量
//	//printf("a = %d b = %d\n", a, b);
//	//a = a + b;
//	//b = a - b;
//	//a = a - b;
//	//printf("a = %d b = %d\n", a, b);
//	////有缺陷：数值太大会溢出
//	//3.使用 ^ 操作符
//	printf("a = %d b = %d\n", a, b);
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//	printf("a = %d b = %d\n", a, b);
//	//a ^ a = 0 ，0 ^ a = a
//	return 0;
//}
//求一个整数存储在内存中的二进制中1的数量
//int main()
//{
//	int num = 0;
//	printf("请输入一个整数:>");
//	scanf("%d", &num);
//	int count = 0;
//	for (int i = 0; i < 32; i++)
//	{
//		if (((num >> i) & 1) == 1)
//		{
//			count++;
//		}
//	}
//	printf("%d的二进制位中1的数量为%d个。\n", num, count);
//	return 0;
//}