#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>

//int main()
//{
//	int a = 2;
//	int b = a << 1;//把a的二进制位向左移动一位
//	printf("b = %d\n", b);
//	return 0;
//}
//int main()
//{
//	int a = -1;
//	int b = a >> 1;//把a的二进制位向右移动一位
//	printf("b = %d\n", b);
//	//结果还是-1，说明当前的右移操作符使用的是 算术右移
//	return 0;
//}
//int main()
//{
//	int a = 3;
//	int b = 5;
//	//int c = a & b;// & - 按(2进制)位与
//	// 规则：两者为1才是1,其余为0
//	//a 00000000000000000000000000000011  = 3
//	//b 00000000000000000000000000000101  = 5
//	//c 00000000000000000000000000000001  = 1
//	//int c = a | b;// | - 按(2进制)位或 
//	// 规则：相同不变,相异为1
//	//a 00000000000000000000000000000011  = 3
//	//b 00000000000000000000000000000101  = 5
//	//c 00000000000000000000000000000111  = 7
//	//int c = a ^ b;// ^ - 按(2进制)位异或
//	//对应的二进制位进行异或
//	//规则：相同为0，相异为1
//	//a 00000000000000000000000000000011  = 3
//	//b 00000000000000000000000000000101  = 5
//	//c 00000000000000000000000000000110  = 6
//	printf("%d\n", c);
//	return 0;
//}
//int main()
//{
//	int a = 3;
//	int b = 5;
//	//交换a,b
//	////1.使用第三变量
//	//printf("a = %d b = %d\n", a, b);
//	//int c = a;
//	//a = b;
//	//b = c;
//	//printf("a = %d b = %d\n", a, b);
//	////2.不使用第三变量
//	//printf("a = %d b = %d\n", a, b);
//	//a = a + b;
//	//b = a - b;
//	//a = a - b;
//	//printf("a = %d b = %d\n", a, b);
//	////有缺陷：数值太大会溢出
//	//3.使用 ^ 操作符
//	printf("a = %d b = %d\n", a, b);
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//	printf("a = %d b = %d\n", a, b);
//	//a ^ a = 0 ，0 ^ a = a
//	return 0;
//}
//求一个整数存储在内存中的二进制中1的数量
//int main()
//{
//	int num = 0;
//	printf("请输入一个整数:>");
//	scanf("%d", &num);
//	int count = 0;
//	for (int i = 0; i < 32; i++)
//	{
//		if (((num >> i) & 1) == 1)
//		{
//			count++;
//		}
//	}
//	printf("%d的二进制位中1的数量为%d个。\n", num, count);
//	return 0;
//}
//int main()
//{
//	int flag = 5;
//	//flag为真,打印hehe
//	if (flag)
//	{
//		printf("hehe\n");
//	}
//	//flag为假,打印haha
//	if (!flag)//! - 反逻辑操作
//	{
//		printf("haha\n");
//	}
//	return 0;
//}
//int main()
//{
//	short s = 5;
//	int a = 10;
//	printf("%d\n", sizeof(s = a + 2));
//	//sizeof括号中放的表达式是不参与运算的
//	printf("%d\n", s);
//	return 0;
//}
//int main()
//{
//	int a = -1;
//	int b = ~a;// ~ - 对一个数的二进制按位取反
//	printf("%d\n", b);
//	return 0;
//}
//int main()
//{
//	int a = 13;
//	//把a的二进制中的第5位置成1
//	a = a | (1 << 4);
//	printf("a = %d\n", a);
//	//把a的二进制中的第5位置成0
//	a = a & ~(1 << 4);
//	printf("a = %d\n", a);
//	return 0;
//}
//int main()
//{
//	int a = 10;
//	//int b = a++;//后置++ : 先使用，再++
//	int b = ++a;//前置++ : 先++，再使用
//	printf("%d\n", a);//前置11  后置11
//	printf("%d\n", b);//前置10  后置11
//	//-- 的前置后置意义相同
//	return 0;
//}
//int main()
//{
//	int a = 10;
//	printf("%p\n", &a);//& - 取地址操作符
//	int* pa = &a;//pa是用来存放地址的 - int*说明pa就是一个指针变量
//	*pa = 20;//* - 解引用操作符 - 间接访问操作符
//	printf("%d\n", a);//a = 20
//	return 0;
//}
//sizeof的传参时注意
//void test1(int arr[])//相当于int* arr,传过来的为首元素地址
//{
//	printf("%d\n", sizeof(arr));//4(32位)或者8(64位)
//}
//void test2(char ch[])//同样,等于传过来char* ch
//{
//	printf("%d\n", sizeof(char));//4(32位)或者8(64位)
//}
////指针大小不论类型
//int main()
//{
//	int arr[10] = { 0 };
//	char ch[10] = { 0 };
//	printf("%d\n", sizeof(arr));//40
//	printf("%d\n", sizeof(ch));//10
//	test1(arr);
//	test2(ch);
//	return 0;
//}
//int main()
//{
//	int i = 0, a = 0, b = 2, c = 3, d = 4;
//	//i = a++ && ++b && d++;//下面打印结果为1,2,3,4
//	////当使用&&时,只要左边为假,剩余右边都不计算
//	////例: int c = a && b ,a为0时，b不重要
//	i = a++ || ++b || d++;
//	//当使用||时，只要左边为真，剩余右边也不计算
//	//例: int c = a || b ,a为1时，b不重要
//	printf("a = %d\nb = %d\nc = %d\nd = %d\n", a, b, c, d);
//	return 0;
//}
//int main()
//{
//	int a = 3;
//	int b = 0;
//	if (a > 5)
//		b = 1;
//	else
//		b = -1;
//	//使用三目操作符
//	b = a > 5 ? 1 : -1;//表达式1 ？表达式2 ：表达式3
// 如果表达式1判断结果为 真 成立，  结果为计算 表达式2
// 如果表达式1判断结果为 假 不成立，结果为计算 表达式3
//	return 0;
//}
//int main()
//{
//	int a = 3;
//	int b = 5;
//	int c = 0;
//	//逗号表达式 - 要从左到右依次计算，但是整个表达式的结果是最后一个表达式的结果
//	int d = (c = 5, a = c + 3, b = a - 4, c += 5);
//	printf("%d\n", d);//d = 10
//	return 0;
//}
//int main()
//{
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	printf("%d\n", arr[4]);//[] - 下标引用操作符 - arr数组下标为4的元素
//	//[] 的操作数是2个：  arr  ，  4
//                  一个数组名 + 一个索引值
//	return 0;
//}
////函数定义
//int Add(int x, int y)
//{
//	return x + y;
//}
//void test()
//{}
//int main()
//{
//	int a = 10;
//	int b = 20;
//	//函数调用
//	int ret = Add(a, b);//() - 函数调用操作符
//	test();//() 不能省略
//	return 0;
//}
//struct Book//struct - 自定义一个新的结构体类型
//{
//	//结构体的成员(变量)
//	char name[20];
//	char id[20];
//	int price;
//};// ; 不能少
//int main()
//{
//	struct Book b = { "C语言","C20211109",55 };
//	//printf("书名: %s\n", b.name);//结构体变量名.成员名
//	//printf("书号: %s\n", b.id);
//	//printf("定价: %d\n", b.price);
//	struct Book* pb = &b;
//	//printf("书名: %p\n", (*pb).name);
//	//printf("书号: %p\n", (*pb).id);
//	//printf("定价: %p\n", (*pb).price);
//	printf("书名: %p\n", pb->name);//结构体指针->成员名
//	printf("书号: %p\n", pb->id);
//	printf("定价: %p\n", pb->price);
//	return 0;
//}
//int main()
//{
//	char a = 3;
//	//00000000000000000000000000000011
//	//00000011 - a
//	char b = 127;
//	//00000000000000000000000001111111
//	//01111111 - b
//	char c = a + b;
//	//00000000000000000000000000000011
//	//00000000000000000000000001111111//a和b先提升
//	//00000000000000000000000010000010
//	//10000010 - c//得到c后，因为是char类型，再截断
//	//发现a和b都是char类型的，都没有达到一个int的大小
//	//这里就会发生整形提升
//	//因为要打印%d整形，所以先提升c。
//	//提升后发现符号位为1，是负数，负数在内存中为补码，所以需要得到原码
//	//11111111111111111111111110000010 -- 补码
//	//11111111111111111111111110000001 -- 反码 = 补码 - 1
//	//10000000000000000000000001111110 -- 原码 = 反码符号位不变，其它位取反
//	printf("%d\n", c);//-126
//	return 0;
//}
//int main()
//{
//	char a = 0xb6;
//	short b = 0xb600;
//	int c = 0xb6000000;
//	if (a == 0xb6)
//		printf("a");
//	if (b == 0xb600)
//		printf("b");
//	if (c == 0xb6000000)
//		printf("c");
//	return 0;
//}
//int main()
//{
//	int a = 3;
//	int b = 4;
//	//int c = a + b * 7;//优先级决定了计算顺序
//	int c = a + b + 7;//优先级不起作用，结合性决定了顺序
//	return 0;
//}
