#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>
#include<string.h>

//int main()
//{
//	//int arr[8];
//	//char ch[5];
//	//int n = 8;
//	//int arr[n];
//	//定义数组大小的[]内，应输入常量表达式
//	//只有C99的语法支持时(VS 2019不支持)，可以输入变长数组 - 数组大小是变量
//	//int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };//数组的完全初始化
//	//int arr[10] = { 1,2,3,4,5 };//数组的不完全初始化
//	//int arr2[] = { 1,2,3,4,5 };
//	//这里的arr2[]的大小会成为后面元素的个数，故与arr2[5]表达意思一样
//	//char ch1[5] = { 'y','e','s' };//字符数组的初始化需要‘’单独存放
//	//且不完全初始化时，会将剩下的元素自动充填为‘\0’
//	//char ch2[] = { 'y','e','s' };//同样等于ch2[3]
//	//char ch3[5] = "yes";//y e s \0 0 初始化时如果为字符串，会默认跟一个\0
//	//char ch4[] = "yes";//同上，所以这里的ch4[]等于ch4[4],注意与{‘’}时的区分
//	char ch5[] = "yes";
//	//[y e s \0]
//	char ch6[] = { 'y','e','s' };
//	//[y e s]
//	//printf("%s\n", ch5);
//	//printf("%s\n", ch6);
//	printf("%d\n", strlen(ch5));//3
//	printf("%d\n", strlen(ch6));//随机值
//	
//	return 0;
//}
//int main()
//{
//	int arr[10] = { 0 };
//	arr[4] = 5;// [] - 下标引用操作符
//	int i = 0;
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	for (i = 0; i < sz; i++)
//	{
//		printf("%d ", arr[i]);
//	}
//	return 0;
//}
//int main()
//{
//	int arr[10];
//	int i = 0;
//	for (i = 0; i < 10; i++)
//	{
//		printf("&arr[%d] = %p\n", i, &arr[i]);
//		//%p - 是按地址的格式打印 - 十六进制的打印
//	}
//	return 0;
//}
//一维数组在内存中是连续存放的
//随着数组下标的增长，地址是由低到高变化的
//int main()
//{
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	int* p = arr;//数组名是数组首元素的地址
//	int i = 0;
//	for (i = 0; i < 10; i++)
//	{
//		printf("%d ", *p);
//		p++;
//	}
//	return 0;
//}
//二维数组
//int main()
//{
//	//创建 - 前面的[]为行数，后面的[]为列数
//	//int arr[3][4];
//	//char ch[3][10];
//	//初始化
//	//int arr[3][4] = { 1,2,3,4,5,6,7,8,9,10,11,12 };
//	//int arr[3][4] = { 1,2,3,4,5,6,7 };//不完全初始化 - 后面补0
//	//int arr[3][4] = { {1,2},{3,4},{4,5} };
//	//int arr[][4] = { {1,2},{3,4},{4,5} };//行数可以省略，但列数不可以省略
//	//二维数组在数组中的存储
//	int arr[][4] = { {1,2},{3,4},{4,5} };
//	int i, j = 0;
//	int* p = &arr[0][0];
//	for (i = 0; i < 12; i++)
//	{
//		printf("%d ", *p);
//		p++;
//	}
//	//for (i = 0; i < 3; i++)
//	//{
//	//	for (j = 0; j < 4; j++)
//	//	{
//	//		printf("&arr[%d][%d] = %p\n", i, j, &arr[i][j]);
//	//	}
//	//}
//	//二维数组在内存中也是连续存放的，跨行也是连续的
//	return 0;
//}
//void bubble_sort(int arr[],int sz)//形参arr本质是指针
//{
//	//冒泡排序的思想：两两相邻的元素进行比较，并且可能的话需要交换
//	//int sz = sizeof(arr) / sizeof(arr[0]);//错误的,应在函数外计算完传参
//	//确定执行次数
//	int i = 0;
//	for (i = 0; i < sz - 1; i++)
//	{
//		//一次冒泡排序的过程
//		int j = 0;
//		int flag = 1;
//		for (j = 0; j < sz - 1 - i; j++)
//		{
//			if (arr[j] > arr[j + 1])
//			{
//				//交换
//				int tmp = arr[j];
//				arr[j] = arr[j + 1];
//				arr[j + 1] = tmp;
//				flag = 0;
//			}
//		}
//		//效率化 - 如果数组已经是有序排序，不需要再冒泡排序，结束无效的循环
//		if (flag == 1)
//		{
//			break;
//		}
//	}
//}
//int main()
//{
//	int arr[] = { 9,8,7,6,5,4,3,2,1,0 };
//	//排序为升序 - 冒泡排序
//	//计算数组元素个数
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	bubble_sort(arr,sz);//数组传参时，传递的其实是数组首元素的地址
//	return 0;
//}
//int main()
//{
//	int arr[10] = { 0 };
//	//int sz = sizeof(arr);
//	//printf("%d\n", sz);//结果为40
//	//数组名表示数组首元素地址，但是有两个例外
//	//1.sizeof(数组名) - 数组名表示整个数组 - 计算的是整个数组的大小，单位是字节
//	//2.&数组名 - 数组名表示整个数组 - 取出的是整个数组的地址
//	printf("%p\n", &arr);//1 - &arr取出的是整个数组的地址
//	printf("%p\n", &arr+1);//整个数组的地址+1，所以相差40个字节
//	printf("%p\n", arr);//2 - arr取出的是首元素的地址
//	printf("%p\n", arr+1);//首元素地址+1，为下一个元素，所以相差4个字节
//	printf("%p\n", &arr[0]);//3 - &arr[0]取出的是下标为0的元素的地址
//	return 0;
//}